# Написать программу, получающую набор произведений чисел от 1 до N.
# Пример: пусть N = 4, тогда [1, 2, 6, 24] (1, 1*2, 1*2*3, 1*2*3*4)

N = int(input('введи число: '))
total = [1]
[total.append(total[-1] * i) for i in range(1, N + 1)]
print(total[1:])
